//
//  AthkarCollectionVC.swift
//  FinalProject
//
//  Created by mohammad.alsharif on 20/05/1443 AH.
//

import Foundation
import UIKit
import SwiftUI

class AthkarCollectionVC: UIViewController, UICollectionViewDelegate, UICollectionViewDataSource {
    

    
    
    
    var index = 0
    
    var morningAthkar = [
        "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق",
        "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم",
        "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ : { اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ }  [آية الكرسي - البقرة 255]",
        "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم { قُلْ هُوَ ٱللَّهُ أَحَدٌ (١) ٱللَّهُ ٱلصَّمَدُ (٢) لَمْ يَلِدْ وَلَمْ يُولَد (٣)، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ (٤) }",
        "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم { قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ (١) مِن شَرِّ مَا خَلَقَ (٢) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (٣) وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ(٤) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ(٥) }",
        "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم { قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ (١) مَلِكِ ٱلنَّاسِ (٢) إِلَٰهِ ٱلنَّاسِ (٣) مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ (٤) ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ (٥) مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ (٦) }",
        "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُ بِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر",
        "اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور",
        "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ",
        "اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك",
        "اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر",
        "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ",
        "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم",
        "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي",
        "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم",
        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ",
        "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً",
        "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْن",
        "أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه",
        "أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ",
        "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه",
        "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ",
        "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد",
        "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِير",
        "سُبْحـانَ اللهِ وَبِحَمْـدِهِ",
        "أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ"
    ]
    
    var morningAthkarCounter = [
        "٣ مرات",
        "٣ مرات",
        "١ مرة",
        "٣ مرات",
        "٣ مرات",
        "٣ مرات",
        "١ مرة",
        "١ موة",
        "١ مرة",
        "٤ مرات",
        "١ مرة",
        "٣ مرات",
        "٧ مرات",
        "١ مرة",
        "١ مرة",
        "١ مرة",
        "٣ مرات",
        "١ مرة",
        "١ مرة",
        "١ مرة",
        "٣ مرات",
        "١٠ مرات",
        "١٠ مرات",
        "١٠٠ مرة",
        "١٠٠ مرة",
        "١٠٠ مرة"
        
    ]
    
    var nightAthkar = [
        "أَعُوْذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
        "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم",
        "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ : { اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ }  [آية الكرسي - البقرة 255]",
        "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم { قُلْ هُوَ ٱللَّهُ أَحَدٌ (١) ٱللَّهُ ٱلصَّمَدُ (٢) لَمْ يَلِدْ وَلَمْ يُولَد (٣)، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ (٤) }",
        "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم { قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ (١) مِن شَرِّ مَا خَلَقَ (٢) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (٣) وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ(٤) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ(٥) }",
        "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم { قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ (١) مَلِكِ ٱلنَّاسِ (٢) إِلَٰهِ ٱلنَّاسِ (٣) مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ (٤) ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ (٥) مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ (٦) }",
        "أَمْسَيْـنا وَأَمْسـى المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هذه اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا، رَبِّ أَعـوذُ بِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر",
        "اللَّهُمَّ بِكَ أمْسَيْنَا، وَبِكَ أصْبَحْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوْتُ، وَإليْكَ الـمَصِيْرُ",
        "اللَّهُمَّ أنْتَ رَبِّي لا إلَهَ إلاَّ أَنْتَ، خَلَقْتَنِي وأنَا عَبْدُكَ، وأَ نَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أعُوْذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أ بُوْءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وأبُوْءُ بِذَنْبِي فَاغْفِر لِي فَإنَّه لا يَغْفِرُ الذُّنُوبَ إلاَّ أَنْتَ",
        "اللَّهُمَّ إنِّي أمْسَيْنتُ أُشْهِدُكَ، وأُشْهِدُ حَمَلَةَ عَرْشِكَ، ومَلائِكَتِكَ، وجَميْعَ خَلْقِكَ، أنَّكَ أنْتَ اللهُ لا إلَهَ إلاَّ أنْتَ وَحْدَكَ لا شَرِيْكَ لَكَ، وأنَّ مُحَمَّدًا عَبْدُكَ ورَسُولُكَ",
        "اللَّهُمَّ مَا أمْسَى بِي مِنْ نِعْمَةٍ، أوْ بِأحَدٍ مِنْ خَلقِكَ، فَمِنْكَ وَحْدَكَ لا شَرِيْكَ لَكَ، فَلَكَ الـحَمْدُ ولَكَ الشُّكْرُ",
        "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إلَهَ إلاَّ أنْتَ، اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنَ الكُفْرِ وَالفَقْرِ، وأَعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ، لا إلَهَ إلاَّ أنْتَ",
        "حَسْبِيَ اللهُ لاَ إلَهَ إلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ، وَهُوَ رَبُّ العَرْشِ العَظِيمِ",
        "اللهُمَّ إنِّي أسْألُكَ العَفْوَ والعَافيةَ في الدُّنْيَا والآخِرَةِ، اللهُمَّ إنِّي أسْألُكَ العَفْوَ والعَافيةَ في دِيْني ودُنْيَاي، وأهْلِي، ومَالي، اللهُمَّ اسْتُرْ عَوْرَاتي، وآمِنْ رَوْعَاتي، اللهُمَّ احْفَظْني مِنْ بيْنِ يَدَيَّ، ومِنْ خَلْفِي، وعَنْ يَميني، وعَنْ شِمَالي، ومِنْ فَوْقِي، وأعُوذُ بِعَظَمَتكَ أنْ أُغْتالَ مِنْ تَحْتي",
        "اللَّهُمَّ عَالِمَ الغَيْبِ والشَّهَادَةِ، فَاطِرَ السَّموَاتِ والأرْضِ، رَبَّ كُلِّ شَيءٍ ومَلِيْكَهُ، أشْهَدُ أنْ لا إلَهَ إلاَّ أنْتَ، أعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وأنْ أقْتَرِفَ عَلَى نَفْسِي سُوءًا، أوْ أجُرَّهُ إلَى مُسْلِمٍ",
        "رَضِيْتُ باللَّهِ رَبًّا، وبالإسْلامِ دِيْنًا، وبِمُحَمَّدٍ نَبيًّا",
        "يَا حَيُّ يَا قَيُّومُ بِرَحْـمَتِكَ أسْتَغِيثُ، أصْلِحْ لِي شَأْنِي كُلَّهُ، وَلاَ تَكِلْنِي إلَى نَفْسِي طَرْفَةَ عَيْنٍ",
        "أمْسَيْنَا وأمْسَى الـمُلْكُ للَّهِ رَبِّ العَالَمينَ، اللَّهُمَّ إنِّي أسْألُكَ خَيْرَ هَذِهِ اللَّيْلَةِ، فَتْحَهَا، ونَصْرَهَا ونُوْرَهَا، وبَرَكَتهَا، وَهُدَاهَا، وأعُوْذُ بِكَ مِنْ شَرِّ مَا فيْهَا وَشَرِّ مَا بَعْدَهَا",
        "أمْسَيْنَا عَلَى فِطْرَةِ الإسْلامِ، وعَلَى كَلِمَةِ الإخْلاصِ، وعَلَى دِيْنِ نَبيِّنَا مُحَمَّدٍ صلى الله عليه وسلم، وعَلَى مِلَّةِ أبِينَا إبْرَاهيمَ، حَنيفًا مُسْلِمًا ومَا كَانَ مِنَ الـمُشْرِكِينَ",
        "لا إلَهَ إلاَّ اللهُ وَحْدَهُ لا شَرِيْكَ لَهُ، لَهُ الـمُلْكُ، ولَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيءٍ قَديرٌ",
        "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبيِّنَا مُـحَمَّدٍ",
        "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ"
    ]
    
    var nightAthkarCounter = [
        "٣ مرات",
        "٣ مرات",
        "١ مرة",
        "٣ مرات",
        "٣ مرات",
        "٣ مرات",
        "١ مرة",
        "١ مرة",
        "١ مرة",
        "٤ مرات",
        "١ مرة",
        "٣ مرات",
   "٧ مرات",
        "١ مرة",
        "١ مرة",
        "٣ مرات",
        "١ مرة",
 "١ مرة",
        "١ مرة",
    "١٠ مرة",
        "١٠ مرات",
        "١٠٠ مرة"
        
    ]
    
    var prayerAthkar = [
        "أسْتَغْفِرُ اللهَ",
        "اللَّهُمَّ أنْتَ السَّلاَمُ، وَمِنْكَ السَّلاَمُ، تَبَارَكْتَ يَا ذَا الجَلالِ والإكْرَامِ",
        "لا إلَهَ إلاَّ اللهُ وَحْدَهُ لا شَريكَ لَهُ، لَهُ الـمُلْكُ ولَهُ الـحَمْدُ، وهُوَ عَلَى كُلِّ شَيءٍ قَدِيرٌ",
        "اللَّهُمَّ لاَ مَانِعَ لِـمَا أعْطَيْتَ، ولا مُعْطِيَ لِـمَا مَنَعْتَ، ولاَ يَنْفَعُ ذَا الجَدِّ مِنْكَ الجَدُّ",
        "لاَ إلَهَ إلاَّ اللهُ وَحْدَهُ لا شَرِيْكَ لَهُ، لَهُ الـمُلْكُ، وَلَهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيءٍ قَديرٌ، لاَ حَوْلَ وَلاَ قُوَّةَ إلاَّ باللَّهِ، لاَ إلَهَ إلاَّ اللهُ، وَلا نَعْبُدُ إلاَّ إيَّاهُ، لَهُ النِّعْمَةُ ولَهُ الفَضْلُ ولَهُ الثَّنَاءُ الحَسَنُ، لاَ إلَهَ إلاَّ اللهُ مُخلِصِينَ لَهُ الدِّيْنَ ولَوْ كَرِهَ الكَافِرُونَ",
        "سُبْحَانَ اللَّهِ",
        "والحَمْدُ للهِ",
        "واللهُ أكْبَرُ",
        "لاَ إلَهَ إلاَّ اللهُ وَحْدَهُ لا شَرِيْكَ لَهُ، لَهُ الـمُلْكُ ولَهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيءٍ قَدِيرٌ",
        "لا إلهَ إلاَّ اللهُ وَحْدَهُ لا شَريكَ لَهُ، لَهُ المُلْكُ ولَهُ الحَمْدُ، يُحيي ويُميتُ، وهُوَ عَلَى كُلِّ شَيءٍ قديرٌ",
      "{ اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ }  [آية الكرسى - البقرة 255]",
        "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم { قُلْ هُوَ ٱللَّهُ أَحَدٌ(١) ٱللَّهُ ٱلصَّمَدُ(٢) لَمْ يَلِدْ وَلَمْ يُولَد(٣)، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ(٤) }",
        "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم { قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ(١) مِن شَرِّ مَا خَلَقَ(٢) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ(٣) وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ(٤) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ(٥) }",
        "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم { قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ(١) مَلِكِ ٱلنَّاسِ(٢) إِلَٰهِ ٱلنَّاسِ(٣) مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ(٤) ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ(٥) مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ(٦) }",
        "اللَّهمُّ إنِّي أسأَلُكَ عِلمًا نَافِعًا، ورِزْقًا طَيِّبًا، وعَمَلًا مُتَقَبَّلًا"
    ]
    
    var prayerAthkarCounter = [
        "٣ مرات",
        "١ مرة",
        "٣ مرات",
     "١ مرة",
    "١ مرة",
        "٣٣ مرة",
        "٣٣ مرة",
        "٣٣ مرة",
        "١ مرة",
        "١٠ مرات بعد صلاة المغرب والفجر",
    "١ مرة",
        "٣ مرات",
        "٣ مرات",
        "٣ مرات",
        "١ مرة بعد صلاة الفجر"
    ]
    
    var foodAthkar = [
        ""
    ]
    
    var foodAthkarCounter = [
        ""
    ]
    
    var sleepAthkar = [
        "أذكار النوم : أعوذ بالله من الشيطان الرجيم : { اللَّهُ لَا إِلَهَ إِلَّا هُوَ الـْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ } [آية الكرسي - البقرة 255]",
        """
يَجْمَعُ كَفَّيْهِ ثُمَّ يَنْفُثُ فيهمَا فيَقْرأ فِيْهمَا: {قُلْ هُوَ اللَّهُ أَحَدٌ (١) اللَّهُ الصَّمَدُ (٢) لَمْ يَلِدْ وَلَمْ يُولَدْ (٣) وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ (٤) } ،
{قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ (١) مِنْ شَرِّ مَا خَلَقَ (٢) وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ (٣) وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ (٤) وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ (٥) } ، {قُلْ أَعُوذُ بِرَبِّ النَّاسِ (١) مَلِكِ النَّاسِ (٢) إِلَهِ النَّاسِ (٣) مِنْ شَرِّ الْوَسْوَاسِ الـْخَنَّاسِ (٤) الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ (٥) مِنَ الْـجِنَّةِ وَالنَّاسِ (٦) } . ثُمَّ يَمْسَحُ بهِمَا مَا اسْتَطَاعَ مِنْ جَسَدِهِ؛ يَبْدأُ بِهِـمَا عَلَى رَأسِهِ وَوَجْهِهِ وَمَا أقْبَلَ مِنْ جَسَدِهِ
""",
    "{آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالـْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ وَقَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الـْمَصِيرُ * لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ}",
        "فلينفض فراشه بداخلة إزاره ثم يقول : ((باسْمِكَ رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أرْفَعُهُ، فَإنْ أمْسَكْتَ نَفْسِي فَارْحَمْهَا، وإنْ أرْسَلْتَهَا فاحْفَظْهَا، بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحينَ))",
        "اللَّهُمَّ إنَّكَ خَلَقْتَ نَفْسِي وأَنْتَ تَوَفَّاهَا، لَكَ مَمَاتُهَا وَمَـحْيَاهَا، إنْ أحْيَيْتَها فَاحْفَظْها، وَإنْ أمَتَّهَا فَاغْفِرْ لَهَا، اللَّهُمَّ إنِّي أسْألُكَ العَافِيةَ",
        "يضع يده اليمنى تحت خده ثم يقول : ((اللَّهُمَّ قِنِي عَذَابَكَ، يَوْمَ تَبْعَثُ عِبَادَكَ))",
        "بِاسْمِكَ اللَّهُمَّ أمُوتُ وَأحْيَا",
        "سُبْحَانَ اللَّهِ",
        "وَالـحَمْدُ للَّهِ",
        "وَاللَّهُ أكْبَرُ",
        "اللَّهُمَّ رَبَّ السَّمَـوَاتِ السَّبْعِ، ورَبَّ الأرْضِ، ورَبَّ العَرْشِ العَظِيمِ، رَبَّنَا ورَبَّ كُلِّ شَيءٍ، فالِقَ الحَبِّ والنَّوَى، وَمُنْزِلَ التَّوْرَاةِ والإنْجِيلِ والفُرْقَانِ، أعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيءٍ أنْتَ آخِذٌ بِنَاصِيتهِ، اللَّهُمَّ أنْتَ الأوَّلُ فَلَيْسَ قَبْلَكَ شَيءٌ، وأنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَيءٌ، وأنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيءٌ، وأنْتَ البَاطِنُ فَلَيْسَ دُونَكَ شَيءٌ، اقْضِ عَنَّا الدَّيْنَ، وَأَغْنِنَا مِنَ الفَقْرِ",
    "الحَـمْدُ للَّهِ الَّذِي أطْعَمَنَا وسَقَانَا، وكَفَانَا، وآوَانا؛ فَكَمْ مِمَّنْ لا كَافِيَ لَهُ وَلا مُؤْوِيَ",
        "اللَّهُمَّ عَالِـمَ الغَيْبِ والشَّهَادَةِ، فَاطِرَ السَّمَـوَاتِ والأرْضِ، رَبَّ كُلِّ شَيءٍ ومَلَيْكَهُ، أشْهَدُ أنْ لا إلَهَ إلاَّ أنْتَ، أعُوْذُ بِكَ مِنْ شَرِّ نَفْسِي، ومِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وأنْ أقْتَرِفَ عَلَى نَفْسِي سُوءًا، أوْ أَجُرَّهُ إلَى مُسْلِمٍ",
        "يتوضأ وضوءه للصلاة ، ثم يضطجع على شقه الأيمن ، ثم يقول : ((اللَّهُمَّ أسْلَمْتُ نَفْسِي إلَيْكَ، وَفَوَّضْتُ أمْرِي إلَيْكَ، وَوَجَّهْتُ وَجْهِي إلَيْكَ، وألـْجَأتُ ظَهْرِي إلَيْكَ، رَغْبَةً ورَهْبَةً إلَيْكَ، لاَ مَلْجَأ وَلا مَنْجَا مِنْكَ إلاَّ إلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أنْزَلْتَ، وَبِنَبيِّكَ الَّذِي أرْسَلْتَ))",
    "أذكار الإستيقاظ من النوم : الْـحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أمَاتَنَا وإِلَيْهِ النُّشُورُر",
    "لَا إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْـمُلْكُ وَلَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيءٍ قَدِيرٌ، سُبْحَانَ اللَّهِ، والْـحَمْدُ للَّهِ، وَلَا إِلَهَ إِلاَّ اللهُ ، وَاللهُ أَكْبَرُ، وَلاَ حَوْلَ وَلا قُوَّة إِلاَّ بِاللَّهِ العَلِيِّ العَظِيمِ، رَبِّ اغْفِر لِي",
    "الـحَمْدُ للَّهِ الَّذِي عَافَانِي في جَسَدِي، وَرَدَّ عَلَيَّ رُوحِي، وَأَذِنَ لِي بذِكْرِهِ",
        "((اللَّهُمَّ عَالِـمَ الغَيْبِ والشَّهَادَةِ، فَاطِرَ السَّمَـوَاتِ والأرْضِ، رَبَّ كُلِّ شَيءٍ ومَلَيْكَهُ، أشْهَدُ أنْ لا إلَهَ إلاَّ أنْتَ، أعُوْذُ بِكَ مِنْ شَرِّ نَفْسِي، ومِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وأنْ أقْتَرِفَ عَلَى نَفْسِي سُوءًا، أوْ أَجُرَّهُ إلَى مُسْلِمٍ))",
        "((اللَّهُمَّ أسْلَمْتُ نَفْسِي إلَيْكَ، وَفَوَّضْتُ أمْرِي إلَيْكَ، وَوَجَّهْتُ وَجْهِي إلَيْكَ، وألـْجَأتُ ظَهْرِي إلَيْكَ، رَغْبَةً ورَهْبَةً إلَيْكَ، لاَ مَلْجَأ وَلا مَنْجَا مِنْكَ إلاَّ إلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أنْزَلْتَ، وَبِنَبيِّكَ الَّذِي أرْسَلْتَ))",
        "الدعاء إذا تقلب ليلاً : لاَ إلَهَ إلاَّ اللهُ الوَاحِدُ القَهَّارُ، ربُّ السَّمَوَاتِ والأرْضِ وَمَا بَيْنَهُمَا العَزِيْزُ الغَفَّارُ",
        "دعاء الفزع من النوم ومن بلي بالوحشة :أَعُوذُ بِكَلِمَـاتِ اللَّهِ التَّامَّاتِ، مِنْ غَضَبِهِ وَعِقَابِهِ، وشَرِّ عِبَادِهِ، وَمِنْ هَمَزَاتِ الشَّيَاطِينِ، وأنْ يَحْضُرُونِ",
        "ما يفعل من رأى الرؤيا أو الحلم : يَنْفُثُ عَن يَسارِهِ",
        "يستعيذُ باللهِ مِنَ الشَّيْطَانِ، ومِنْ شَرِّ مَا رَأَى",
        "يتحول عن جنبه الذي كان عليه",
"يقوم يصلي إن أراد ذلك"
    ]
    
    var sleepAthkarCounter = [
    "١ مرة",
    "٣ مرات",
"١ مرة",
   "١ مرة",
    "١ مرة",
"١ مرة",
    "١ مرة",
  "٣٣ مرة",
    "٣٣ مرة",
    "٣٤ مرة",
 "١ مرة",
 "١ مرة",
    "١ مرة",
    "١ مرة",
        "١ مرة",
    "١ مرة",
    "١ مرة",
    "١ مرة",
    "١ مرة",
    "١ مرة",
    "١ مرة",
    "٣ مرات",
    "١ مرة",
"١ مرة",
    "١ مرة"
    ]

    @IBOutlet weak var collectionViewAthkar : UICollectionView!
    
    override func viewDidLoad() {
        super.viewDidLoad()
        
        collectionViewAthkar.register(UINib(nibName: "AthkarCollectionPage", bundle: nil), forCellWithReuseIdentifier: "Cell")
        collectionViewAthkar.delegate = self
        collectionViewAthkar.dataSource = self
    }
    
    override func viewDidLayoutSubviews() {
        super.viewDidLayoutSubviews()
    }
    
    func collectionView(_ collectionView: UICollectionView, numberOfItemsInSection section: Int) -> Int {
        if index == 0 {
            return morningAthkar.count
        } else if index == 1 {
            return nightAthkar.count
        } else if index == 2 {
            return prayerAthkar.count
        } else if index == 3 {
            return foodAthkar.count
        } else {
            return sleepAthkar.count
        }
    }
    
    func collectionView(_ collectionView: UICollectionView, cellForItemAt indexPath: IndexPath) -> UICollectionViewCell {
        let cell = collectionView.dequeueReusableCell(withReuseIdentifier: "Cell", for: indexPath) as! AthkarCollectionPage
        if index == 0 {
            cell.thekrLabel.text = morningAthkar[indexPath.row]
            cell.thekrCounterLabel.text = morningAthkarCounter[indexPath.row]
        } else if index == 1 {
            cell.thekrLabel.text = nightAthkar[indexPath.row]
            cell.thekrCounterLabel.text =  nightAthkarCounter[indexPath.row]
        } else if index == 2 {
            cell.thekrLabel.text = prayerAthkar[indexPath.row]
            cell.thekrCounterLabel.text =  prayerAthkarCounter[indexPath.row]
        } else if index == 3 {
            cell.thekrLabel.text = foodAthkar[indexPath.row]
            cell.thekrCounterLabel.text =  foodAthkarCounter[indexPath.row]
        } else {
            cell.thekrLabel.text = sleepAthkar[indexPath.row]
            cell.thekrCounterLabel.text =  sleepAthkarCounter[indexPath.row]
        }
        
        cell.widthConstraint.constant = collectionView.frame.width - 0
        cell.heightConstraint.constant = collectionView.frame.height
        return cell
    }
    
    func collectionView(_ collectionView: UICollectionView, didSelectItemAt indexPath: IndexPath) {
//        morningAthkar[indexPath.row]
//        collectionView.scrollToItem(at: [indexPath.row], at: (item: index, Section: 0) .centeredVertically, animated: true)
    }

}
